app/assets/xml_templates/instant_purchase_closeout_domain.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <InstantPurchaseCloseoutDomain xmlns="GdAuctionsBiddingWSAPI_v2">
      <domainName>DOMAIN_NAME</domainName>
      <closeoutDomainPriceKey>CLOSEOUT_DOMAIN_PRICE_KEY</closeoutDomainPriceKey>
      <acceptUTOS>ACCEPT_UTOS</acceptUTOS>
      <acceptAMA>ACCEPT_AMA</acceptAMA>
      <acceptDNRA>ACCEPT_DNRA</acceptDNRA>
    </InstantPurchaseCloseoutDomain>
  </soap12:Body>
</soap12:Envelope>
